ZuluIDE/ZuluIDE-firmware/lib/ZuluIDE_platform_RP2350/ZuluIDE_platform.cpp
    // SD card pins
    // Card is used in SDIO mode, rp2040_sdio.cpp will redirect these to PIO1
    //        pin             function       pup   pdown  out    state fast
    gpio_conf(SDIO_CLK,       GPIO_FUNC_SIO, true, false, true,  true, true);
    gpio_conf(SDIO_CMD,       GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D0,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D1,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D2,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D3,        GPIO_FUNC_SIO, true, false, false, true, true);

    // I2C pins
    //        pin                 function       pup   pdown  out    state fast
    gpio_conf(GPIO_I2C_SCL,       GPIO_FUNC_I2C, true, false, false,  true, true);
    gpio_conf(GPIO_I2C_SDA,       GPIO_FUNC_I2C, true, false, false,  true, true);

    // IDE bus control signals
    //        pin             function       pup   pdown  out    state fast
    gpio_conf(CTRL_LOAD,      GPIO_FUNC_SIO, false, false, true,  false, true);
    gpio_conf(CTRL_nEN,       GPIO_FUNC_SIO, false, false, true,  true,  true);
    gpio_conf(CTRL_IN_SEL,    GPIO_FUNC_SIO, false, false, true,  true,  true);
    gpio_conf(IDE_DATASEL,    GPIO_FUNC_SIO, false, false, true,  true, true);
    gpio_conf(IDE_DATADIR,    GPIO_FUNC_SIO, false, false, true,  false, true);
    gpio_conf(IDE_IORDY_OUT,  GPIO_FUNC_SIO, false, false, true,  false, true);
    gpio_conf(IDE_IORDY_EN,   GPIO_FUNC_SIO, false, false, true,  true,  true);
    gpio_conf(IDE_IOCS16,     GPIO_FUNC_SIO, false, false, true,  true,  true);

    // IDE bus status signals
    gpio_conf(IDE_RST,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DIOW,       GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DIOR,       GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DA0,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DA1,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DA2,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_CS0,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_CS1,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DMACK,      GPIO_FUNC_SIO, false, false, false, false, true);

    // IDE bus data signals
    for (int i = 0; i < 16; i++)
    {
        gpio_conf(IDE_D0 + i, GPIO_FUNC_SIO, false, false, false, false, true);
    }

    // Status LED
    gpio_conf(STATUS_LED,     GPIO_FUNC_SIO, false,false, true,  false, false);
}

// late_init() only runs in main application
void platform_late_init()
{

}

uint8_t platform_check_for_controller()
{
    return 0;
}

void platform_set_status_controller(zuluide::ObserverTransfer<zuluide::status::SystemStatus> *statusController) {
  
}

void platform_set_display_controller(zuluide::Observable<zuluide::control::DisplayState>& displayController) {
}

void platform_set_input_interface(zuluide::control::InputReceiver* inputReceiver) {
}

void platform_set_device_control(zuluide::status::DeviceControlSafe* deviceControl) {
}

void platform_poll_input() {
}

void platform_write_led(bool state)
{
    if (g_led_disabled || g_led_blinking) return;

    gpio_put(STATUS_LED, state);
}

void platform_set_blink_status(bool status)
{
    g_led_blinking = status;
}

void platform_write_led_override(bool state)
{
    if (g_led_disabled) return;

    gpio_put(STATUS_LED, state);

}
void platform_disable_led(void)
{   
    g_led_disabled = true;
    logmsg("Disabling status LED");
}

void platform_init_eject_button(uint8_t eject_button)
{
    if (eject_button & 1)
    {
        //        pin                   function       pup   pdown  out    state fast
        gpio_conf(GPIO_EJECT_BTN_1_PIN, GPIO_FUNC_SIO, true, false, false, true, false);
        g_eject_buttons |= 1;
    }

    if (eject_button & 2)
    {
        gpio_conf(GPIO_EJECT_BTN_2_PIN, GPIO_FUNC_SIO, true, false, false, true, false);
        g_eject_buttons |= 2;
    }
}

uint8_t platform_get_buttons()
{
    uint8_t buttons = 0;

    if ((g_eject_buttons & 1) && (!gpio_get(GPIO_EJECT_BTN_1_PIN))) 
        buttons |= 1;
    if ((g_eject_buttons & 2) && !gpio_get(GPIO_EJECT_BTN_2_PIN)) 
        buttons |= 2;

    // Simple debouncing logic: handle button releases after 100 ms delay.
    static uint32_t debounce;
    static uint8_t buttons_debounced = 0;

    if (buttons != 0)
    {
        buttons_debounced = buttons;
        debounce = millis();
    }
    else if ((uint32_t)(millis() - debounce) > 100)
    {
        buttons_debounced = 0;
    }

    return buttons_debounced;
}

int platform_get_device_id(void)
{
    if (g_dip_cable_sel)
    {
        if (g_cable_sel_state)
            return 1;    // CSEL wire has been cut, secondary device
        else
            return 0;    // CSEL wire grounded, primary device
    }
    else
    {
        if (g_dip_drive_id)
            return 1;    // PRI/SEC switch on, secondary device
        else
            return 0;    // PRI/SEC switch off, primary device
    }
}

/*****************************************/
/* Crash handlers                        */
/*****************************************/

extern SdFs SD;
extern uint32_t __StackTop;
static void usb_log_poll();

void platform_emergency_log_save()
{
    volatile uint core_num = get_core_num();
    if (core_num != 0)
    {
        logmsg("Only core 0 may attempt 'platform_emergency_log_save()'");
        return;
    }

    platform_set_sd_callback(NULL, NULL);

    SD.begin(SD_CONFIG_CRASH);
    FsFile crashfile = SD.open(CRASHFILE, O_WRONLY | O_CREAT | O_TRUNC);

    if (!crashfile.isOpen())
    {
        // Try to reinitialize
        int max_retry = 10;
        while (max_retry-- > 0 && !SD.begin(SD_CONFIG_CRASH));

        crashfile = SD.open(CRASHFILE, O_WRONLY | O_CREAT | O_TRUNC);
    }

    uint32_t startpos = 0;
    crashfile.write(log_get_buffer(&startpos));
    crashfile.write(log_get_buffer(&startpos));
    crashfile.flush();
    crashfile.close();
}

extern "C" __attribute__((noinline))
void show_hardfault(uint32_t *sp, uint32_t r4, uint32_t r5, uint32_t r6, uint32_t r7)
{
    uint32_t pc = sp[6];
    uint32_t lr = sp[5];

    // When the main firmware is run in non-secure mode, the secure mode
    // fault handler forwards to us. It stores context in r4-r7.
    bool sec_fault = (r4 == 0xACCE55ED);

