ZuluIDE/ZuluIDE-firmware/lib/ZuluIDE_platform_RP2350/ZuluIDE_platform.cpp
    // Avoid any mbed timer interrupts triggering during the flashing.
    uint32_t saved_irq = save_and_disable_interrupts();

    // For some reason any code executed after flashing crashes
    // unless we disable the XIP cache.
    // Not sure why this happens, as flash_range_program() is flushing
    // the cache correctly.
    // The cache is now enabled from bootloader start until it starts
    // flashing, and again after reset to main firmware.
    xip_ctrl_hw->ctrl = 0;

    flash_range_erase(offset, PLATFORM_FLASH_PAGE_SIZE);
    flash_range_program(offset, buffer, PLATFORM_FLASH_PAGE_SIZE);

    uint32_t *buf32 = (uint32_t*)buffer;
    uint32_t num_words = PLATFORM_FLASH_PAGE_SIZE / 4;
    for (int i = 0; i < num_words; i++)
    {
        uint32_t expected = buf32[i];
        uint32_t actual = *(volatile uint32_t*)(XIP_NOCACHE_NOALLOC_BASE + offset + i * 4);

        if (actual != expected)
        {
            logmsg("Flash verify failed at offset ", offset + i * 4, " got ", actual, " expected ", expected);
            return false;
        }
    }

    restore_interrupts(saved_irq);

    return true;
}

void platform_boot_to_main_firmware()
{
    // To ensure that the system state is reset properly, we perform
    // a SYSRESETREQ and jump straight from the reset vector to main application.
    g_bootloader_exit_req = &g_bootloader_exit_req;
    scb_hw->aircr = 0x05FA0004;
    while(1);
}

void btldr_reset_handler()
{
    uint32_t* application_base = &__real_vectors_start;
    if (g_bootloader_exit_req == &g_bootloader_exit_req)
    {
        // Boot to main application
        application_base = (uint32_t*)(XIP_BASE + PLATFORM_BOOTLOADER_SIZE);
    }

    scb_hw->vtor = (uint32_t)application_base;
    __asm__(
        "msr msp, %0\n\t"
        "bx %1" : : "r" (application_base[0]),
                    "r" (application_base[1]) : "memory");
}

// Replace the reset handler when building the bootloader
// The rp2040_btldr.ld places real vector table at an offset.
__attribute__((section(".btldr_vectors")))
const void * btldr_vectors[2] = {&__StackTop, (void*)&btldr_reset_handler};

#endif


/********************************/
/* 2nd core code                */
/********************************/
void zuluide_setup(void)
{
}

mutex_t* platform_get_log_mutex() {
  return &logMutex;
}

void processStatusUpdate(const zuluide::status::SystemStatus &currentStatus) {
}

/********************************/
/* Logic sniffer functionality  */
/********************************/

bool platform_enable_sniffer(const char *filename, bool passive)
{
    if (passive)
    {
        // Stop IDE phy and configure pins for passive input
        g_idecomm.enable_idephy = false;

        // Configure IDE bus for input mode
        // Data buffer is enabled in input mode.
        // Control buffer is disabled.
        for (int i = 0; i < 16; i++)
        {
            gpio_conf(IDE_D0 + i, GPIO_FUNC_SIO, false, false, false, false, true);
        }

        //        pin             function       pup   pdown  out    state fast
        gpio_conf(IDE_RST,        GPIO_FUNC_SIO, false, false, false, false, true); // Input
        gpio_conf(IDE_DIOW,       GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DIOR,       GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DA0,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DA1,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DA2,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_CS0,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_CS1,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DMACK,      GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(CTRL_LOAD,      GPIO_FUNC_SIO, false, false, true, false, true); // Don't load ctrl mux
        gpio_conf(CTRL_nEN,       GPIO_FUNC_SIO, false, false, true, true, true);  // Disable ctrl mux
        gpio_conf(CTRL_IN_SEL,    GPIO_FUNC_SIO, false, false, true, true, true);  // Disable ctrl in mux
        gpio_conf(IDE_IORDY_EN,   GPIO_FUNC_SIO, false, false, true, true, true);  // Disable IORDY out
        gpio_conf(IDE_IOCS16,     GPIO_FUNC_SIO, false, false, true, true, true);  // Disable IOCS16 out
        gpio_conf(IDE_DATADIR,    GPIO_FUNC_SIO, false, false, true, false, true); // Data input
        gpio_conf(IDE_DATASEL,    GPIO_FUNC_SIO, false, false, true, false, true); // Enable data buffer
    }

    g_sniffer_enabled = true;
    return rp2350_sniffer_init(filename, passive);
}

void platform_sniffer_poll()
{
    rp2350_sniffer_poll();
}

/*************************************************/
/* SDK overrides for running in non-secure mode  */
/*************************************************/

#ifdef ARM_NONSECURE_MODE
// When the main firmware runs under ARM TrustZone, we must
// override some SDK functions. These have already been
// initialized by the bootloader.

extern "C" void runtime_init_bootrom_reset()
{
}

extern "C" void runtime_init_early_resets()
{
}

extern "C" void runtime_init_post_clock_resets()
{
    // JTAG and TBMAN peripherals are secure access only,
    // so we have to mask them out of reset.
    unreset_block_mask_wait_blocking(0x1fbffeff);
}

extern "C" void runtime_init_boot_locks_reset()
{
}

extern "C" void runtime_init_bootrom_locking_enable()
{
}

extern "C" void runtime_init_per_core_bootrom_reset()
{
}

#endif
